import openpyxl

# Читаем excel-файл:
wb = openpyxl.load_workbook('contractors_and_suppliers.xlsx')

sheets = wb.sheetnames

# ====== Получаем нужный нам лист по индексу: ====== #
sheet = wb[sheets[0]]
# ================================================== #

# ====== Печатаем список листов: ====== #
# for sheet in sheets:
    # print(sheet)
# ===================================== #
    
# ====== Получаем активный лист: ====== #
# sheet = wb.active
# print(sheet)
# ===================================== #

# ====== Печатаем нужный нам лист: ====== #
# print(sheet)
# ======================================= #

# ====== Печатаем тип и значение содержимого ячейки: ====== #
# print(type(sheet['J28'].value))
# print(sheet['J28'].value)
# ========================================================= #

# ====== Определяем кол-во строк в выбранном нами листе: ====== #
# column_a = sheet['A']
# count = 0
# for cell in column_a[3:]:
    # count += 1
# print(count)
# ============================================================= #

# ====== Проходим циклом по типам и значениям содержимых нужной нам колонки (колонки - латинские буквы, строки - числа): ====== #
# ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O']
column = sheet['I'][3:-1]
for cell in column:
    print(type(cell.value))
    print(cell.value.strftime('%d.%m.%Y'))
# ============================================================================================================================= #        

# ====== Выводим значения всех ячеек активного листа: ====== #
# for row in sheet.rows:
    # string = ''
    # for cell in row:
        # string = string + str(cell.value) + ' '
    # print(string)
# =================================================== ====== #